---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures
source: html/b5f85718-fcb7-9396-e706-6d04f0c25c34.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures

Failures detected by overlap check.

## Syntax (C#)
```csharp
public static class OverlapFailures
```